'''
培根密码是一种简单的替换密码，密码字符只有两个:a和b,每个明文字符都会被替换为一个由a和b组成的长度为5的字符串
- 比如明文h被替换后的密文是aabbb
- 密文字符也可以是选择任意两个其他字符
- 如果看到这种全部由两个字母组成的密文，那么就可以猜测可能是培根密码
在线加解密：https://tool.bugku.com/peigen/
'''

'''
题目名称：我想吃培根
题目描述：-- --- .-. ... . ..--.- .. ... ..--.- -.-. --- --- .-.. ..--.- -... ..- - ..--.- -... .- -.-. --- -. ..--.- .. ... ..--.- -.-. --- --- .-.. . .-. ..--.- -- -- -.. -.. -- -.. -- -.. -- -- -- -.. -.. -.. /-- -.. -- -.. -.. --/ -- -- -- -- -- /-- -.. -.. -- -.. -- /-- -.. -.. --
格式：flag{***********}
来源：https://blog.csdn.net/m0_68517352/article/details/124390692
抹除掉字符串中的斜杠 "/" 莫斯解密拿到
MORSE_IS_COOL_BUT_BACON_IS_COOLER_MMDDMDMDMMMDDDMDMDDMMMMMMMDDMDMMDDM
内容"MMDDMDMDMMMDDDMDMDDMMMMMMMDDMDMMDDM"很显然是培根密码
替换内容为AB拿到解密网站解密
https://tool.bugku.com/peigen/
内容为guowang
'''
def woXiangChiPeiGen():
    key = "-- --- .-. ... . ..--.- .. ... ..--.- -.-. --- --- .-.. ..--.- -... ..- - ..--.- -... .- -.-. --- -. ..--.- .. ... ..--.- -.-. --- --- .-.. . .-. ..--.- -- -- -.. -.. -- -.. -- -.. -- -- -- -.. -.. -.. /-- -.. -- -.. -.. --/ -- -- -- -- -- /-- -.. -.. -- -.. -- /-- -.. -.. --"
    v1 = key.replace("/", "")
    print(v1)
    print("MMDDMDMDMMMDDDMDMDDMMMMMMMDDMDMMDDM".translate(''.maketrans("MD", "AB")))
